//Найти все нечетные числа в массиве от 1 до 15 включительно и вывести их в консоль.
//Массив [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15] Использовать for of.


console.log("");
console.log("Пятая задача");


//первый вариант
let mas5t = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15];

for (let i = mas5t.length-1; i >=0; i--){
    if (mas5t[i]%2 != 0) {
        console.log(mas5t[i])
    }
}

console.log("");

// Второй вариант
let mas5tt = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15];

for (let value of mas5tt){
    if (value%2 != 0) {
        console.log(value)
    }
}